---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.NotAllPartsWereConvertedCannotAddPlaceholderWarning
source: html/3cca92eb-843c-45a3-d4d6-6b6880b0ff61.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.NotAllPartsWereConvertedCannotAddPlaceholderWarning Property

Not all parts were converted. Placeholders could not be added to fill the gap (the gap was too small). Check the fabrication service definition for the system.

## Syntax (C#)
```csharp
public static FailureDefinitionId NotAllPartsWereConvertedCannotAddPlaceholderWarning { get; }
```